
&НаСервереБезКонтекста
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура, Дата)
	ДанныеОтбора   = Новый Структура("Номенклатура", Номенклатура);
	
	ДанныеРегистра = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(Дата,ДанныеОтбора);
	НужныйВидЦены  = Справочники.ВидыЦен.НайтиПоНаименованию("Закупочная");
	Для Каждого Строка Из ДанныеРегистра Цикл
		Если Строка.ВидЦены = НужныйВидЦены Тогда
			Возврат Строка.Цена;	
		КонецЕсли;		
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	Товар.ЦенаПоступления = ТоварыНоменклатураПриИзмененииНаСервере(Товар.Номенклатура, Объект.Дата);
	Товар.Стоимость       = Товар.Количество * Товар.ЦенаПоступления;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	Товар.Стоимость = Товар.Количество * Товар.ЦенаПоступления;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Для Каждого Товар Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Товар.Номенклатура) Тогда
			Товар.ЦенаПоступления = ТоварыНоменклатураПриИзмененииНаСервере(Товар.Номенклатура, Объект.Дата);
			Товар.Стоимость = Товар.Количество * Товар.ЦенаПоступления;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьДоговорПоУмолчаниюНаСервере(Контрагент) Экспорт
	Возврат РасчетыКлиентСервер.ПолучитьДоговорПоУмолчаниюНаСервере(Контрагент);
КонецФункции

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	Объект.Договор = ПолучитьДоговорПоУмолчаниюНаСервере(Объект.Поставщик);
КонецПроцедуры


