
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Договор		= ДанныеЗаполнения.Договор;
		Заказ 		= ДанныеЗаполнения.Ссылка;
		Сумма 		= ДанныеЗаполнения.ОбщаяСтоимость;
		Контрагент	= ДанныеЗаполнения.Покупатель;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		Договор 	= ДанныеЗаполнения.Договор;
		Заказ 		= ДанныеЗаполнения.Заказ;
		Сумма 		= ДанныеЗаполнения.ОбщаяСумма;
		Контрагент 	= ДанныеЗаполнения.Покупатель;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Хозрасчетный 
	Движения.Хозрасчетный.Записывать = Истина;
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.КассаОрганизации;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Договор;
КонецПроцедуры
