
&НаСервере
Процедура Пронумеровать()
	СтрокВШапке = Результат.ФиксацияСверху;
	КоличествоКолонок = Результат.ШиринаТаблицы;
	ОбластьШапки = Результат.Область(СтрокВШапке - 1,, СтрокВШапке - 1);
	ОбластьПриемник = Результат.Область(СтрокВШапке + 1,, СтрокВШапке + 1);
	Результат.ВставитьОбласть(ОбластьШапки, ОбластьПриемник, ТипСмещенияТабличногоДокумента.ПоГоризонтали, Ложь);
	
	Для Ном = 1 По КоличествоКолонок Цикл
		ТекОбласть = Результат.Область(СтрокВШапке + 1, Ном);
		ТекОбласть.Текст = "" + Ном;
		ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	КонецЦикла;
	
	Результат.ФиксацияСверху = Результат.ФиксацияСверху + 1; 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Непосредственно);
	Пронумеровать();
КонецПроцедуры
