Функция ОсновнойМетод(Запрос)

	Куки  = Неопределено;
    Ответ = Неопределено;
    ПараметрыКлиента     = Авторизация.ПолучитьПараметрыКлиента(Запрос, Куки);
    КоличествоПараметров = Запрос.ПараметрыЗапроса.Количество();
	
	Если ОсновнойPOST(Запрос, Ответ, ПараметрыКлиента) Тогда
	ИначеЕсли ПустаяСтрока(Запрос.ОтносительныйURL) И КоличествоПараметров = 0 Тогда
        //  Главная страница
    	Ответ = Новый HTTPСервисОтвет(200);
        Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
        
        Страница = Компонент.СоздатьСтраницу("Наша Фирма");
        Ответ.УстановитьТелоИзСтроки(Компонент.ВСтроку(Страница));
    
	ИначеЕсли Аутентификация(Запрос, Ответ, ПараметрыКлиента) Тогда 
	ИначеЕсли СкриптСтраницы(Запрос, Ответ) Тогда 
	КонецЕсли;
	Если Ответ <> Неопределено Тогда
		// Отмечаем активность пользователя в куках, сохраняем настройки ПараметрыКлиента
        Авторизация.ПараметрыКлиентаВОтвет(ПараметрыКлиента, Ответ);
    Иначе
    	// ОтветРедиректа(Запрос, Ответ);
		Ответ = Новый HTTPСервисОтвет(404);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция Аутентификация(Запрос, Ответ, ПараметрыКлиента)
	Если Запрос.ОтносительныйURL = "/login" Тогда
	    Пользователь = Запрос.ПараметрыЗапроса["user"];
	    Пароль 		 = Запрос.ПараметрыЗапроса["password"];
	    
	    Если ЗначениеЗаполнено(Пользователь) Тогда
			Ошибка = Авторизация.Авторизовать(ПараметрыКлиента, Пользователь, Пароль);
		Иначе
			Ошибка = """user"":""Не запольнено имя пользователя """;
		КонецЕсли; 
	 
	    Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки("{""success"": "
									+ ?(ПустаяСтрока(Ошибка), "true", "false")
									+ ", ""message"": """", ""data"": {" 
									+ Ошибка 
									+ "}}");
	КонецЕсли;
	Возврат Ответ <> Неопределено; 
КонецФункции

Функция ОтветРедиректа(Запрос, Ответ, НовыйАдрес = Неопределено)
	Ответ = Новый HTTPСервисОтвет(302);
	Ответ.Заголовки.Вставить("Location"
		, ?(ЗначениеЗаполнено(НовыйАдрес)
			, НовыйАдрес
			, Запрос.БазовыйURL)
		);
	Возврат Истина; 
КонецФункции  
Функция СкриптСтраницы(Запрос, Ответ)
	Если Запрос.ОтносительныйURL = "/main.js" Тогда
		Ответ = Новый HTTPСервисОтвет(200);
	    Ответ.Заголовки.Вставить("Content-Type","text/javascript; charset=utf-8");
	    Ответ.УстановитьТелоИзСтроки(ПолучитьОбщийМакет("СкриптСтраницы").ПолучитьТекст());
	КонецЕсли; 
	Возврат Ответ <> Неопределено;
КонецФункции
Функция ОсновнойPOST(Запрос, Ответ, ПараметрыКлиента)
	Если Запрос.HTTPМетод = "POST"
	   И ПустаяСтрока(Запрос.ОтносительныйURL) 
	   И СтрНайти(Запрос.Заголовки["Content-Type"], "application/json") > 0 Тогда
		
		Попытка
			ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();  
			ПараметрыЗапроса = Компонент.СоздатьИзJSON(ТелоЗапроса);
		Исключение
            Ошибка = ОписаниеОшибки();
		КонецПопытки; 
		
		Если ТипЗнч(ПараметрыЗапроса) = Тип("Соответствие") Тогда
			Имя = ПараметрыЗапроса["Компонент"];
			Действие = ПараметрыЗапроса["Действие"];
			Данные = ПараметрыЗапроса["Данные"];
			Если ЗначениеЗаполнено(Имя) Тогда
			    
			    Ответ = Новый HTTPСервисОтвет(200);
				Ответ.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
				
				Попытка
					// Создаём/обновляем компонент
					ПрмКомпонента = ПриложениеСайта.Обновить(Имя, Данные, ПараметрыКлиента);
					Ответ.УстановитьТелоИзСтроки("{""Успех"": true,""Действие"": """ 
						+ Действие 
						+ """,""Данные"": " 
						+ Компонент.ВJSON(ПрмКомпонента) 
						+ "}");
					Возврат Ответ <> Неопределено;
				Исключение
				    Ошибка = ОписаниеОшибки();
				КонецПопытки; 
			Иначе
				Ошибка = ?(ПустаяСтрока(Ошибка)
					   , "Не указан тип компонента для обновления"
					   , Ошибка); 
				
			КонецЕсли;
		Иначе
			Ошибка = ?(ПустаяСтрока(Ошибка)
				   , "Неизвестный формат запроса"
				   , Ошибка); 
		КонецЕсли;
		Если Не ПустаяСтрока(Ошибка) Тогда
		    Ответ = Новый HTTPСервисОтвет(200);
			Ответ.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
			
			Ответ.УстановитьТелоИзСтроки("{""Успех"": false,""Действие"": """ 
				+ Действие 
				+ """,""Данные"": {""Ошибка"":""" 
				+ Ошибка 
				+ """}}");
			
			Возврат Ответ <> Неопределено; 
		КонецЕсли; 
    КонецЕсли; 
	Возврат Ответ <> Неопределено; 
КонецФункции


 
