

Процедура ПередЗаписью(Отказ)
	//  Проверка на уже существуюшую аналогичную запись
	ВыборкаДолжность = Справочники.Должности.Выбрать();
	Пока ВыборкаДолжность.Следующий() Цикл
		Если ЭтотОбъект.Ссылка       <> ВыборкаДолжность.Ссылка 
		   И ЭтотОбъект.Наименование  = ВыборкаДолжность.Наименование
		   И ЭтотОбъект.Подразделение = ВыборкаДолжность.Подразделение Тогда
			
			Сообщение             = Новый СообщениеПользователю();
			Сообщение.Текст       = "Такая должность в подразделении уже существуют!";
			Сообщение.Поле        = "Должность";
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.КлючДанных  = ЭтотОбъект.Ссылка;
			Сообщение.Сообщить();
			Отказ                 = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	//  Обновление Должностей сотрудников
	Индекс = Сотрудники.Количество() - 1;
	Пока Индекс >= 0  Цикл
		Строка = Сотрудники.Получить(Индекс);
		Если ЗначениеЗаполнено(Строка.Сотрудник.Наименование) Тогда
			Сотрудник               = Строка.Сотрудник.ПолучитьОбъект();
			Сотрудник.Должность     = ЭтотОбъект.Ссылка;
			Сотрудник.Подразделение = ЭтотОбъект.Подразделение;
			Сотрудник.Записать();
		Иначе
			Сотрудники.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

