
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Договор 		= ДанныеЗаполнения.Договор;
		ЗаказКлиента 	= ДанныеЗаполнения.Ссылка;
		ВалютнаяСумма 	= ДанныеЗаполнения.ОбщаяСтоимость;
		Контрагент 		= ДанныеЗаполнения.Покупатель;
		СчетОрганизации = Справочники.СчетаОрганизации.ОсновнойРублевыйСчет;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроводитьВсеПоСчету52 = Ложь;

	ВалютаСуммы = СчетОрганизации.ВалютаСчета;
	// регистр Хозрасчетный
	Движения.Хозрасчетный.Записывать = Истина;
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.Период = Дата;
	Движение.Сумма = РублеваяСумма;

	Если (ВалютаСуммы = Справочники.Валюты.Рубль 
		ИЛИ ВалютаСуммы = Справочники.Валюты.ПустаяСсылка())
		И Не ПроводитьВсеПоСчету52 Тогда
	// Если счет организации рублёвый, проводим по 51 счету
	
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СчетОрганизации] = СчетОрганизации;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Договор;
	Иначе
	// Если счет организации валютный, проводим по 52 счету
	
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
		Движение.ВалютаДт = ВалютаСуммы;
		Движение.ВалютнаяСуммаДт = ВалютнаяСумма;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Договор;
	КонецЕсли;  

КонецПроцедуры

 