&НаКлиенте
Перем СотрудникиСУдаленнымиДолжностями;

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	Сотрудник = Элементы.Сотрудники.ТекущиеДанные.Сотрудник;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Если СотрудникиСУдаленнымиДолжностями = Неопределено Тогда
			СотрудникиСУдаленнымиДолжностями  = Новый Массив();
		КонецЕсли;
		СотрудникиСУдаленнымиДолжностями.Добавить(Сотрудник);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередЗаписьюНаСервере(МассивСотрудников)
	Для Каждого СотрудникСсылка Из МассивСотрудников Цикл
		Сотрудник = СотрудникСсылка.ПолучитьОбъект();
		Сотрудник.Должность = Неопределено;
		Сотрудник.Записать();
	КонецЦикла 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если СотрудникиСУдаленнымиДолжностями <> Неопределено Тогда
		ПередЗаписьюНаСервере(СотрудникиСУдаленнымиДолжностями);
	КонецЕсли;
	//Объект.Наименование = Объект.Наименование + " / " + Объект.Подразделение;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Сотрудники.Очистить();
		Сотрудник = Справочники.ФизическиеЛица.Выбрать();
		Пока Сотрудник.Следующий() Цикл
			Если Сотрудник.Должность = Объект.Ссылка Тогда
				СотрудникВСписке = Объект.Сотрудники.Добавить();
				СотрудникВСписке.Сотрудник = Сотрудник.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


