
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период       = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ВидЦены      = ВидЦены; 
		Движение.Цена         = ?(ВидЦены = Справочники.ВидыЦен.Розничная, 1.1, 1)
                                * ТекСтрокаТовары.Цена;
		Движение.Коментарий   = ?(ВидЦены = Справочники.ВидыЦен.Розничная,
								    "Это комментарий!",
								    "Цена НЕ розничная!");	
	КонецЦикла;
КонецПроцедуры
