&НаСервереБезКонтекста
Функция ПолучитьЦены(ОбновляемыеТовары, Дата, НаименованиеВидаЦены, ДанныеОтбора = Неопределено) Экспорт
	Цены = Новый Массив();
	
	Если ДанныеОтбора = Неопределено Тогда
		ДанныеОтбора = Новый Структура()
	КонецЕсли;
	НужныйВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(НаименованиеВидаЦены);
	ДанныеОтбора.Вставить("ВидЦены", НужныйВидЦены);	
	
	ДанныеРегистра = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(Дата,ДанныеОтбора);
	
	Для Каждого Строка Из ОбновляемыеТовары Цикл
		Если ТипЗнч(Строка) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Товар = Строка.Номенклатура;
		Иначе
			Товар = Строка;
		КонецЕсли;
		Строка = ДанныеРегистра.Найти(Товар, "Номенклатура");
		Если Строка <> Неопределено  Тогда
			Цены.Добавить(Строка.Цена);
		Иначе
			Цены.Добавить(0);
		КонецЕсли;
	КонецЦикла;
	Возврат Цены;
КонецФункции

&НаСервереБезКонтекста
Функция ВидЦеныИзСклада(СкладСсылка) Экспорт
	Если ЗначениеЗаполнено(СкладСсылка) Тогда
		Склад = СкладСсылка.ПолучитьОбъект();
		Если СтрЗаканчиваетсяНа(Склад.Наименование,"ый") Тогда 
			НаименованиеВидаЦены = Лев(Склад.Наименование, СтрДлина(Склад.Наименование)-2);
			НаименованиеВидаЦены = НаименованиеВидаЦены + "ая";
		Иначе
			НаименованиеВидаЦены = "Розничная";
		КонецЕсли;
	Иначе
		НаименованиеВидаЦены = "Розничная";
	КонецЕсли;
	Возврат НаименованиеВидаЦены;
КонецФункции

&НаКлиенте
Процедура ОбновитьЦеныТоваров()
	Товары = Объект.Товары;
	Цены   = ПолучитьЦены(Товары, Объект.Дата, ВидЦеныИзСклада(Объект.Склад));
	Индекс = 0;
	Для Каждого Товар Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Товар.Номенклатура) Тогда
			Товар.ЦенаРеализации = Цены[Индекс];
			Товар.Стоимость      = Товар.Количество * Товар.ЦенаРеализации;
		КонецЕсли;
		Индекс = Индекс+1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	ОбновляемыеТовары = Новый Массив();
	ОбновляемыеТовары.Добавить(Товар.Номенклатура);
	ДанныеОтбора = Новый Структура();
	ДанныеОтбора.Вставить("Номенклатура", Товар.Номенклатура);
	
	Цены = ПолучитьЦены(ОбновляемыеТовары, Объект.Дата, ВидЦеныИзСклада(Объект.Склад), ДанныеОтбора);
	
	Товар.ЦенаРеализации = Цены[0];
	Товар.Стоимость      = Товар.Количество*Товар.ЦенаРеализации;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	Товар.Стоимость = Товар.Количество * Товар.ЦенаРеализации;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьЦеныТоваров();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбновитьЦеныТоваров();
КонецПроцедуры

&НаСервере
Функция ПолучитьДоговорПоУмолчаниюНаСервере(Контрагент) Экспорт
	Возврат РасчетыКлиентСервер.ПолучитьДоговорПоУмолчаниюНаСервере(Контрагент);
КонецФункции

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	Объект.Договор = ПолучитьДоговорПоУмолчаниюНаСервере(Объект.Покупатель);
КонецПроцедуры

