
&НаСервере
Процедура СброситьПараметрыВыбора()
	Элементы.Договор.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
	Элементы.Заказ.СвязиПараметровВыбора   = Новый ФиксированныйМассив(Новый Массив);
КонецПроцедуры

&НаСервере
Процедура ЗаказПриИзмененииНаСервере()
	Заказ = Объект.Заказ;
	Если ЗначениеЗаполнено(Заказ) Тогда
		Объект.Контрагент = Заказ.Поставщик;
		Объект.Сумма 	  = Заказ.ОбщаяСтоимость;
		Объект.Договор	  = РасчетыКлиентСервер.ПолучитьДоговорНаСервере(Заказ);
		Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
			Массив = Новый Массив(1);
			Массив[0] = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
			Элементы.Договор.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
		КонецЕсли; 
	Иначе
		СброситьПараметрыВыбора();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.Договор = РасчетыКлиентСервер.ПолучитьДоговорНаСервере(Объект.Контрагент);
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Массив = Новый Массив(1);
		Массив[0] = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
		Элементы.Договор.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
		
		Массив[0] = Новый СвязьПараметраВыбора("Отбор.Поставщик", "Объект.Контрагент");
		Если ЗначениеЗаполнено(Объект.Договор) Тогда
			Массив.Добавить(Новый СвязьПараметраВыбора("Отбор.Договор", "Объект.Договор"));
		КонецЕсли; 
		Элементы.Заказ.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
	Иначе
		СброситьПараметрыВыбора();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Если Объект.Заказ.Договор <> Объект.Договор Тогда
		Объект.Заказ = Документы.ЗаказПоставщику.ПустаяСсылка();
	КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.Контрагент = Объект.Договор.Владелец;
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Массив = Новый Массив(1);
			Массив[0] = Новый СвязьПараметраВыбора("Отбор.Договор", "Объект.Договор");
			Элементы.Заказ.СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
 

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ЗаказПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры
