Функция Создать(ТипСвойств = "КлючИЗначение", ТипСоответствие = Ложь) Экспорт
	Если ТипСвойств = "Массив" Тогда
		ПараметрыСвойства = Новый Массив();
		ПараметрыСвойства.Добавить("_ЭтоСвойство");
	Иначе
		Если ТипСоответствие Тогда
			ПараметрыСвойства = Новый Соответствие();
			ПараметрыСвойства.Вставить("_Ст", Ложь);
		Иначе
			ПараметрыСвойства = Новый Структура();
			ПараметрыСвойства.Вставить("_Ст", Истина);
		КонецЕсли; 
		ПараметрыСвойства.Вставить("_ЭтоСвойство", Истина);
		ПараметрыСвойства.Вставить("_Тип", ТипСвойств);
	КонецЕсли;

	Возврат ПараметрыСвойства;	
КонецФункции

Функция ЭтоСвойство(ПараметрыСвойства) Экспорт
	Если ТипЗнч(ПараметрыСвойства) = Тип("Структура") Тогда
		Если ПараметрыСвойства.Свойство("_ЭтоСвойство") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли; 
	Если ТипЗнч(ПараметрыСвойства) = Тип("Соответствие") Тогда
		Если ПараметрыСвойства["_ЭтоСвойство"] = Истина Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЕсли;
	Если ТипЗнч(ПараметрыСвойства) = Тип("Массив") Тогда
		Если ПараметрыСвойства[0] = "_ЭтоСвойство" Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЕсли; 
	Возврат Ложь;				
КонецФункции

Функция _ВСтроку(Значение)
	Если Компонент.ЭтоКомпонент(Значение) Тогда
		Возврат Компонент.ВСтроку(Значение);
	ИначеЕсли СвойстваКомпонента.ЭтоСвойство(Значение) Тогда
		Возврат СвойстваКомпонента.ВСтроку(Значение);
	КонецЕсли;
	Возврат Значение;	
КонецФункции
 
 
Функция ВСтроку(ПараметрыСвойства) Экспорт
	Текст = "";
	Если ТипЗнч(ПараметрыСвойства) = Тип("Массив") Тогда
		Разделитель = "";
		Для Индекс = 1 По ПараметрыСвойства.ВГраница() Цикл
			Текст = Текст + Разделитель + _ВСтроку(ПараметрыСвойства[Индекс]);
			Разделитель = " ";
		КонецЦикла; 
		Возврат Текст;
	КонецЕсли; 
	
	ТипСвойств = ПараметрыСвойства["_Тип"];
	
	Если ТипСвойств = "КлючИЗначение" Тогда
		КавычкиКлюча = "";
		Разделитель = "=";
		Кавычки = """";
		Между = " ";
	ИначеЕсли ТипСвойств = "JSON" Тогда
		КавычкиКлюча = """";
		Разделитель = ":";
		Кавычки = """";
		Между = ",";
	ИначеЕсли ТипСвойств = "JSОбъект" Тогда
		КавычкиКлюча = "";
		Разделитель = ":";
		Кавычки = """";
		Между = ",";
	Иначе
		КавычкиКлюча = "";
		Разделитель = " ";
		Кавычки = "";
		Между = " ";
	КонецЕсли;
		
	МД = "";
	Для каждого КлЗнч Из ПараметрыСвойства Цикл
		
		Имя = КлЗнч.Ключ;
		Если Имя = "_ЭтоСвойство"
		 ИЛИ Имя = "_Тип"
		 ИЛИ Имя = "_Ст" Тогда
			Продолжить;
		КонецЕсли;
		Если Не ПараметрыСвойства["_Ст"] Тогда //  Представление в 1С
			Имя = _ВСтроку(Имя);
		КонецЕсли;
		Если СтрНачинаетсяС(Имя, "_Ст_") Тогда  //  Представление после сериализации
			Если СтрНачинаетсяС(Имя, "_Ст_Ключ") Тогда
//          Пишем значение как ключ
				Текст = Текст 
					  + МД 
					  + КавычкиКлюча
					  + _ВСтроку(КлЗнч.Значение)
					  + КавычкиКлюча;
				//  МД = Между; //   ?????
				Продолжить;
//			ИначеЕсли СтрНачинаетсяС(Имя, "_Ст_Знач") Тогда 
//			Пишем как обычное значение,но без ключа
			КонецЕсли; 
		Иначе
//          Обычный ключ
			Текст = Текст 
				  + МД 
				  + КавычкиКлюча
				  + Имя
				  + КавычкиКлюча;
		КонецЕсли;  

		МД = Между;

		Если КлЗнч.Значение <> Неопределено  //  Значение не пустое
		 ИЛИ Не ПустаяСтрока(КлЗнч.Значение)
		 ИЛИ ТипСвойств = "JSON" Тогда

			Текст = Текст 
				  + Разделитель 
				  + Кавычки
				  + _ВСтроку(КлЗнч.Значение)
				  + Кавычки; 
		КонецЕсли;
	КонецЦикла; 	
	Возврат Текст;
КонецФункции

Функция Заполнить(ПараметрыСвойства, Соответствие) Экспорт
	Для каждого КлЗнч Из Соответствие Цикл
		ПараметрыСвойства.Вставить(КлЗнч.Ключ, КлЗнч.Значение);
	КонецЦикла;
	Возврат ПараметрыСвойства; 
КонецФункции
  