

&НаСервереБезКонтекста
Функция ОкладыСотрудникПриИзмененииНаСервере(Сотрудник)
	Результат = Новый Структура("Должность			, Подразделение"
							   , Сотрудник.Должность, Сотрудник.Подразделение);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОкладыСотрудникПриИзменении(Элемент)
	ТекДанные = Элемент.Родитель.ТекущиеДанные;
	ДанныеСотрудника = ОкладыСотрудникПриИзмененииНаСервере(ТекДанные.Сотрудник);
	ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеСотрудника);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОкладыДолжностьПриИзмененииНаСервере(Должность)
	Возврат Новый Структура("Подразделение", Должность.Подразделение);
КонецФункции

&НаКлиенте
Процедура ОкладыДолжностьПриИзменении(Элемент)
	ТекДанные = Элемент.Родитель.ТекущиеДанные;
	ДанныеДолжности = ОкладыДолжностьПриИзмененииНаСервере(ТекДанные.Должность);
	ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеДолжности);
КонецПроцедуры
