// Общий модуль разработан для расчетов на стороне клиента

#Область ПрограммныйИнтерфейс
// Расчитывает стоимость товара или услуги
//
// Параметры:
//  Цена           -   Число   -  цена за единицу товара/услуги
//  Количество     -   Число   -  количество товаров/услуг
// 
// Возвращаемое значение:
//   Число - стоимость
//
&НаКлиенте
Функция РассчитатьСтоимость(Цена, Количество) Экспорт
    Стоимость = Цена*Количество;
    Возврат Стоимость;
КонецФункции

&НаСервере
Функция ПолучитьДоговорПоУмолчаниюНаСервере(Контрагент) Экспорт
	Если Контрагент.Пустая() Тогда
		Возврат Справочники.Договоры.ПустаяСсылка();
	Иначе
		Объект = Контрагент.ПолучитьОбъект();
		Возврат Объект.ДоговорПоУмолчанию;
	КонецЕсли; 
КонецФункции

&НаСервере
Функция ПолучитьДоговорНаСервере(ЗаказИлиКонтрагент) Экспорт
	Если ТипЗнч(ЗаказИлиКонтрагент) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Если Не ЗаказИлиКонтрагент.Пустая() Тогда
			Объект = ЗаказИлиКонтрагент.ПолучитьОбъект();
			Договор = Объект.Договор;
			Если Не Договор.Пустая() Тогда
				Возврат Договор;
			КонецЕсли; 
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗаказИлиКонтрагент) = Тип("СправочникСсылка.Контрагенты") Тогда 
		Возврат РасчетыКлиентСервер.ПолучитьДоговорПоУмолчаниюНаСервере(ЗаказИлиКонтрагент); 
	КонецЕсли;
	Возврат Справочники.Договоры.ПустаяСсылка(); 
КонецФункции
 
#КонецОбласти